[{"sku": ["367703200169"], "description": "Adaptra is a potent, herbal adaptogen formula that improves your mental and physical resilience to help you get through your day with ease.* This amazing all-herbal formula provides the key compounds from extracts of Ashwagandha and Rhodiola that help you meet everyday challenges:\n Manage Stress\n Be in Control\n Maximize Energy\n and Stamina Revitalize Adrenal Function Sharpen Focus and Concentration"},
{"sku": ["367703410049", "367703410094"], "description": "AnxioCalm® is an award-winning, clinically studied supplement that’s been shown to quiet your nerves and relieve occasional anxiety—without drowsiness! It's made from a specialized root extract of Echinacea angustifolia that contains brain-specific alkamides which safely support brain receptors associated with feelings of calm and relaxation.\n It's the safe and effective way to help: \n Relieve occasional anxiety, stress, & nervous tension \n Enhance restful sleep \n Promote mental health and emotional well-being\n AnxioCalm is perfect for everyday use or occasionally when you need extra support. It provides relief when you need it without drowsiness or mental fogginess."},
{"sku": ["367703202965", "367703202927", "367703347062", "367703402068", "367703321437", "367703433628", "367703202934"], "description": "Curcumin is the naturally occurring compound found in turmeric root that gives the herb its powerful antioxidant properties for a healthy inflammation response.*† CuraMed is made with the most clinically studied, enhanced bioavailable curcumin in the world. This specialized curcumin contains turmeric essential oil with ar-turmerone and is scientifically proven to be up to 500 times more powerful than turmeric.^ And it stays in the body for up to 8 hours for better results. Safe, Studied, Effective. The ONLY PATENTED curcumin with turmeric essential oil containing ar-turmerone Superior support for a healthy inflammation response† Supports liver, brain, heart, and immune health Protects cells from oxidative stress and free radicals* High antioxidant ORAC value >1,500,000** Provides 500 mg of full spectrum curcuminoids per softgel From non-GMO turmeric grown without chemicals Over 70 groundbreaking, published studies"}
]